Catalogs/Регионы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>Регионы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Столица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Округ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/АдресныйКлассификатор.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>АдресныйКлассификатор</Name>
			<Comment>Трейд Софт - не переносим</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сокращение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АльтернативныеНазвания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипАдресногоЭлемента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>21</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодАдресногоОбъектаВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодРайонаВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодГородаВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодНаселенногоПунктаВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодУлицыВКоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АдресныеСокращения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>АдресныеСокращения</Name>
			<Comment>Трейд Софт</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>29</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сокращение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Регионы/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьСервер();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСервер()
	КлассификаторАдресныхОбъектовXML = РегистрыСведений.АдресныйКлассификатор.
			ПолучитьМакет("КлассификаторАдресныхОбъектовРоссии").ПолучитьТекст();
	КлассификаторТаблица = УдалитьОбщегоНазначения.ПрочитатьXMLВТаблицу(КлассификаторАдресныхОбъектовXML).Данные;
	
	// 1.
	ТЗ = Новый ТаблицаЗначений;
	// Колонки:
	// Код
	КЧ = Новый КвалификаторыЧисла(2, 0);
	Массив = Новый Массив();
	Массив.Добавить(Тип("Число"));
	ОписаниеТиповЧ = Новый ОписаниеТипов(Массив,,, КЧ);
	ТЗ.Колонки.Добавить("Код", ОписаниеТиповЧ);
	// Регион
	КС = Новый КвалификаторыСтроки(75);
	Массив = Новый Массив();
	Массив.Добавить(Тип("Строка"));
    ОписаниеТиповС = Новый ОписаниеТипов(Массив,, КС);
	ТЗ.Колонки.Добавить("Регион", ОписаниеТиповС);
	// Столица
	КС = Новый КвалификаторыСтроки(50);
	Массив = Новый Массив();
	Массив.Добавить(Тип("Строка"));
    ОписаниеТиповС = Новый ОписаниеТипов(Массив,, КС);
	ТЗ.Колонки.Добавить("Столица", ОписаниеТиповС);
	// Округ
	КС = Новый КвалификаторыСтроки(30);
	Массив = Новый Массив();
	Массив.Добавить(Тип("Строка"));
    ОписаниеТиповС = Новый ОписаниеТипов(Массив,, КС);
	ТЗ.Колонки.Добавить("Округ", ОписаниеТиповС);
	// Сокращение
	КС = Новый КвалификаторыСтроки(10);
	Массив = Новый Массив();
	Массив.Добавить(Тип("Строка"));
    ОписаниеТиповС = Новый ОписаниеТипов(Массив,, КС);
	ТЗ.Колонки.Добавить("Сокращение", ОписаниеТиповС);
	
	Для Каждого АдресныйОбъект Из КлассификаторТаблица Цикл
		Попытка
			КодЧисло = Число(Лев(АдресныйОбъект.Code, 2));
		Исключение
			Сообщить(ОписаниеОшибки());
			Продолжить;
		КонецПопытки;
			
		НоваяСтрока = ТЗ.Добавить();
		НоваяСтрока.Код = КодЧисло;
		НоваяСтрока.Регион = АдресныйОбъект.Name;
		НоваяСтрока.Столица = АдресныйОбъект.Metropolis;
		НоваяСтрока.Округ = АдресныйОбъект.Okrug;
		НоваяСтрока.Сокращение = АдресныйОбъект.Socr;
	КонецЦикла;
	
	// 2. Список элементов для пометки на удаление
	Запрос = Новый Запрос("ВЫБРАТЬ
						|	Регионы.Ссылка
						|ИЗ
						|	Справочник.Регионы КАК Регионы
						|ГДЕ
						|	НЕ Регионы.Код В(&Код)");
	Запрос.УстановитьПараметр("Код", ТЗ.ВыгрузитьКолонку("Код"));//М_Код);
	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Регион_Объект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Регион_Объект.ПометкаУдаления = Истина;
		Регион_Объект.Записать();
	КонецЦикла;
	
	
	// 3. Подготовка итоговой таблицы
	Запрос.Текст = "ВЫБРАТЬ
					|	ТЧ.Код,
					|	ТЧ.Регион,
					|	ТЧ.Столица,
					|	ТЧ.Округ,
					|	ТЧ.Сокращение
					|ПОМЕСТИТЬ ТЧ
					|ИЗ
					|	&ТЗ КАК ТЧ
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ РАЗЛИЧНЫЕ
					|	ЕСТЬNULL(АдресныеСокращения.Наименование, """") КАК НаименованиеСокращения,
					|	ТЧ.Регион,
					|	ТЧ.Столица,
					|	ТЧ.Округ,
					|	ТЧ.Код,
					|	ЕСТЬNULL(Регионы.Ссылка, """") КАК РегионыСправ
					|ИЗ
					|	ТЧ КАК ТЧ
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АдресныеСокращения КАК АдресныеСокращения
					|		ПО ТЧ.Сокращение = АдресныеСокращения.Сокращение
					|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Регионы КАК Регионы
					|		ПО ТЧ.Код = Регионы.Код";
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	ТЗ_Итоговая = Запрос.Выполнить().Выгрузить();
	Для Каждого Стр Из ТЗ_Итоговая Цикл
		Если ЗначениеЗаполнено(Стр.РегионыСправ) Тогда
			Регион_Объект = Стр.РегионыСправ.ПолучитьОбъект();
		Иначе
			Регион_Объект = Справочники.Регионы.СоздатьЭлемент();
		КонецЕсли;
		
		Регион_Объект.Код = Стр.Код;
		Регион_Объект.Регион = Стр.Регион + " " + СокрЛП(НРег(Стр.НаименованиеСокращения));
		Регион_Объект.Столица = СокрЛП(Стр.Столица);
		Регион_Объект.Округ = СокрЛП(Стр.Округ);
		
		Попытка
			Регион_Объект.Записать();
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;	
КонецПроцедуры
